# Customer Account Statement

In this project we will continue with the Account Receivables Database, but this time we will build an account statement for a single customer, for a certain period of time. I will show it step by step, together with the difficulties I encountered on my way.

Let's connect to SQL and to the database

In [1]:
%load_ext sql

In this case we are given the transactions table, for which I will show a sample data for the customer that we will be using as an example to test the queries.

In [36]:
%%sql SELECT CustID, Transact_Date, Amount_EUR_R
        FROM transactions
        WHERE CustID = 411015;

 * mysql://root:***@localhost/ar_sv
14 rows affected.

[('411015', datetime.date(2022, 1, 19), Decimal('91.34')),
 ('411015', datetime.date(2022, 1, 24), Decimal('-91.34')),
 ('411015', datetime.date(2022, 2, 24), Decimal('41.50')),
 ('411015', datetime.date(2022, 3, 28), Decimal('88.50')),
 ('411015', datetime.date(2022, 4, 8), Decimal('-130.00')),
 ('411015', datetime.date(2022, 4, 18), Decimal('12.40')),
 ('411015', datetime.date(2022, 5, 10), Decimal('42.13')),
 ('411015', datetime.date(2022, 5, 10), Decimal('-54.53')),
 ('411015', datetime.date(2022, 6, 9), Decimal('143.30')),
 ('411015', datetime.date(2022, 6, 18), Decimal('-143.30')),
 ('411015', datetime.date(2022, 7, 11), Decimal('55.56')),
 ('411015', datetime.date(2022, 8, 5), Decimal('75.70')),
 ('411015', datetime.date(2022, 8, 11), Decimal('-131.26')),
 ('411015', datetime.date(2022, 8, 15), Decimal('59.10'))]

As you can see, the transactions are on the same column as payments. Payments registered with a negative value and invoices with a positive value. 

Now let's build our query for the account statement, but will separate the invoices and the payments in two separate columns. To do this I will use a CASE WHEN statement, which will include only the positive values for the invoices column, and the negative values in the payments column.

In [37]:
%%sql SELECT CustID , Transact_Date,
CASE
    WHEN Amount_Eur_R >= 0 THEN Amount_Eur_R
    ELSE ' '
END AS Invoices,
CASE
    WHEN Amount_Eur_R < 0 THEN -Amount_Eur_R
    ELSE ' '
END AS Payments
FROM transactions
WHERE CustID = 411015
AND Transact_Date BETWEEN '2022-01-01' AND '2022-05-30'
ORDER BY Transact_Date;

 * mysql://root:***@localhost/ar_sv
8 rows affected.

[('411015', datetime.date(2022, 1, 19), '91.34', ' '),
 ('411015', datetime.date(2022, 1, 24), ' ', '91.34'),
 ('411015', datetime.date(2022, 2, 24), '41.50', ' '),
 ('411015', datetime.date(2022, 3, 28), '88.50', ' '),
 ('411015', datetime.date(2022, 4, 8), ' ', '130.00'),
 ('411015', datetime.date(2022, 4, 18), '12.40', ' '),
 ('411015', datetime.date(2022, 5, 10), '42.13', ' '),
 ('411015', datetime.date(2022, 5, 10), ' ', '54.53')]

The result is looking OK, but it needs also a column for the running balance. 

In pseudo code, this column will be the SUM of the transaction value, PARTION BY the customer, ORDER BY the transaction date. Let's add it.

In [38]:
%%sql SELECT CustID , Transact_Date,
CASE
    WHEN Amount_Eur_R >= 0 THEN Amount_Eur_R
    ELSE ' '
END AS Invoices,
CASE
    WHEN Amount_Eur_R < 0 THEN -Amount_Eur_R
    ELSE ' '
END AS Payments,
SUM(Amount_Eur_R) OVER (PARTITION BY CustID ORDER BY Transact_Date) AS Balance
FROM transactions
WHERE CustID = 411015
AND Transact_Date BETWEEN '2022-01-01' AND '2022-05-30'
ORDER BY Transact_Date;

 * mysql://root:***@localhost/ar_sv
8 rows affected.

[('411015', datetime.date(2022, 1, 19), '91.34', ' ', Decimal('91.34')),
 ('411015', datetime.date(2022, 1, 24), ' ', '91.34', Decimal('0.00')),
 ('411015', datetime.date(2022, 2, 24), '41.50', ' ', Decimal('41.50')),
 ('411015', datetime.date(2022, 3, 28), '88.50', ' ', Decimal('130.00')),
 ('411015', datetime.date(2022, 4, 8), ' ', '130.00', Decimal('0.00')),
 ('411015', datetime.date(2022, 4, 18), '12.40', ' ', Decimal('12.40')),
 ('411015', datetime.date(2022, 5, 10), '42.13', ' ', Decimal('0.00')),
 ('411015', datetime.date(2022, 5, 10), ' ', '54.53', Decimal('0.00'))]

Now we have the column, but te balance is not updating for the transactions which have the same date. This means that we need something else to ORDER BY. 

So we will add row_num, using the row_number() function. First we will need a CTE to create row_num and then use it in the SELECT query for the account statement that we need.

In [39]:
%%sql WITH transactions_1 AS
(
SELECT *, 
       row_number() OVER (PARTITION BY CustID ORDER BY Transact_Date) AS row_num
FROM transactions
)

SELECT CustID , Transact_Date,
CASE
    WHEN Amount_Eur_R >= 0 THEN Amount_Eur_R
    ELSE ' '
END AS Invoices,
CASE
    WHEN Amount_Eur_R < 0 THEN -Amount_Eur_R
    ELSE ' '
END AS Payments,
ROUND(SUM(Amount_Eur_R) OVER (PARTITION BY CustID ORDER BY row_num),2) AS Balance
FROM transactions_1
WHERE CustID = 411015
AND Transact_Date BETWEEN '2022-01-01' AND '2022-05-30'
ORDER BY Transact_Date;

 * mysql://root:***@localhost/ar_sv
8 rows affected.

[('411015', datetime.date(2022, 1, 19), '91.34', ' ', Decimal('91.34')),
 ('411015', datetime.date(2022, 1, 24), ' ', '91.34', Decimal('0.00')),
 ('411015', datetime.date(2022, 2, 24), '41.50', ' ', Decimal('41.50')),
 ('411015', datetime.date(2022, 3, 28), '88.50', ' ', Decimal('130.00')),
 ('411015', datetime.date(2022, 4, 8), ' ', '130.00', Decimal('0.00')),
 ('411015', datetime.date(2022, 4, 18), '12.40', ' ', Decimal('12.40')),
 ('411015', datetime.date(2022, 5, 10), '42.13', ' ', Decimal('54.53')),
 ('411015', datetime.date(2022, 5, 10), ' ', '54.53', Decimal('0.00'))]